/* Alarm occurs [days] Days, [hours] Hours, [minutes] Minutes prior to event */
"%lu Days, %lu Hours, %lu Minutes Before" = "%1$lu Days, %2$lu Hours, %3$lu Minutes Before";

/* The longest possible time string in terms of total character width */
"12:59 PM" = "12:59 PM";

/* The alarm occurs one day before the event's start date */
"ECAlarm.1 Day Before" = "1 Day Before";

/* The alarm occurs one hour before the event's start date */
"ECAlarm.1 Hour Before" = "1 Hour Before";

/* The alarm occurs 15 minutes before the event's start date */
"ECAlarm.15 Minutes Before" = "15 Minutes Before";

/* THe alarm occurs two days before the event's start date */
"ECAlarm.2 Days Before" = "2 Days Before";

/* The alarm occurs two hours before the event's start date */
"ECAlarm.2 Hours Before" = "2 Hours Before";

/* The alarm occurs 30 minutes before the event's start date */
"ECAlarm.30 Minutes Before" = "30 Minutes Before";

/* The alarm occurs six horus before the event's start date */
"ECAlarm.6 Hours Before" = "6 Hours Before";

/* The alarm occurs at a user specified offset prior to the event's start date */
"ECAlarm.Custom" = "Custom";

/* The event has no alarm */
"ECAlarm.None" = "None";

/* The alarm occurs at a date specified by the user */
"ECAlarm.Specific Date" = "Specific Date";

/* The event never stops repeating */
"ECEditEventViewController.RecurrenceEnd.Never" = "RecurrenceEnd.Never";

/* The event repeats on a custom schedule defined by the user */
"ECRecurrenceRule.Custom" = "Custom";

/* The event repeats every day */
"ECRecurrenceRule.Daily" = "Daily";

/* The event repeats on the same date every month */
"ECRecurrenceRule.Monthly" = "Monthly";

/* The event does not repeat */
"ECRecurrenceRule.Never repeats" = "Never repeats";

/* The event never repeats */
"ECRecurrenceRule.None" = "None";

/* The event repeats every [interval] days */
"ECRecurrenceRule.Repeats every %lu days" = "Repeats every %lu days";

/* The event repeats every [interval] months */
"ECRecurrenceRule.Repeats every %lu months" = "Repeats every %lu months";

/* The event repeats every [interval] weeks */
"ECRecurrenceRule.Repeats every %lu weeks" = "Repeats every %lu weeks";

/* The event repeats every [interval] years */
"ECRecurrenceRule.Repeats every %lu years" = "Repeats every %lu years";

/* The event repeats every day */
"ECRecurrenceRule.Repeats every day" = "Repeats every day";

/* The event repeats every month */
"ECRecurrenceRule.Repeats every month" = "Repeats every month";

/* The event repeats every week */
"ECRecurrenceRule.Repeats every week" = "Repeats every week";

/* The event repeats every weekday */
"ECRecurrenceRule.Repeats every weekday" = "Repeats every weekday";

/* The event repeats every year */
"ECRecurrenceRule.Repeats every year" = "Repeats every year";

/* The event repeats every weekday (not weekends) */
"ECRecurrenceRule.Weekdays" = "Weekdays";

/* The event repeats on the same day every week */
"ECRecurrenceRule.Weekly" = "Weekly";

/* The event repeats on the same date every year */
"ECRecurrenceRule.Yearly" = "Yearly";

/* Switch to basic rule selection mode */
"ECRecurrenceRuleCell.Basic" = "Basic";

/* Switch to custom rule selection mode */
"ECRecurrenceRuleCell.Custom" = "Custom";

/* The event should repeat after a given number of days */
"ECRecurrenceRuleCell.Days" = "Days";

/* The event should repeat after a given number of months */
"ECRecurrenceRuleCell.Months" = "Months";

/* The event should repeat after a given number of weeks */
"ECRecurrenceRuleCell.Weeks" = "Weeks";

/* The event should repeat after a given number of years */
"ECRecurrenceRuleCell.Years" = "Years";

/* Cancel deleting event */
"EditEvent.DeleteEvent.ActionSheet.Cancel" = "Cancel";

/* Delete the event */
"EditEvent.DeleteEvent.ActionSheet.Delete Event" = "Delete Event";

/* The user cannot undo deleting an event */
"EditEvent.DeleteEvent.ActionSheet.You cannot undo this action" = "You cannot undo this action";

/* Delete all future occurrences of the event */
"EditEvent.DeleteSpan,ActionSheet.Delete future events" = "Delete future events";

/* Cancel deleting event */
"EditEvent.DeleteSpan.ActionSheet.Cancel" = "Cancel";

/* Delete only the given occurrence of the event */
"EditEvent.DeleteSpan.ActionSheet.Delete this event only" = "Delete this event only";

/* The event being deleted is repeating */
"EditEvent.DeleteSpan.ActionSheet.This is a repeating event" = "This is a repeating event";

/* Cancel saving event */
"EditEvent.SaveSpan.ActionSheet.Cancel" = "Cancel";

/* Save changes for all future occurrences of the event */
"EditEvent.SaveSpan.ActionSheet.Save for future events" = "Save for future events";

/* Save changes only for the selected occurrence of the event */
"EditEvent.SaveSpan.ActionSheet.Save for this event only" = "Save for this event only";

/* The event being saved is repeating */
"EditEvent.SaveSpan.ActionSheet.This is a repeating event" = "This is a repeating event";

/* Switch to absolute date picker */
"ECAlarmCell.Date" = "Date";

/* Switch to relative date picker */
"ECAlarmCell.Before Event" = "Before Event";
